export default {
  origin: "taehoonkwon.com",
  site: "https://taehoonkwon.com",
  author: "권태훈",
  seo: {
    title: "Taehoon Kwon",
    name: "taehoonkwon.com",
    description: "",
  },
  archives: {
    contentDirectory: "articles",
    generatedDirectory: ".generated",
  },
  image: {
    extensions: ["**/*.png", "**/*.jpg", "**/*.jpeg"],
  },
  ga: {
    id: "", // G-XXXXXXXXXX
  },
  hero: ``,
  bio: `
    제 <a href="https://taehoon.craft.me/cv">이력서</a>를 확인할 수 있습니다.<br /><br />

    2018년부터 웹 개발에 전념하면서 주로 프론트엔드를 담당하고 있습니다. 2022년 여름부터 2023년 봄까지는 PLAV에서 일하면서 React, 함수형 반응형 프로그래밍 등의 기술을 사용하여 중고명품 거래를 위한 커뮤니티 플랫폼을 개발했습니다.<br /><br />

    저는 운이 좋게도 IT에 특화된 고등학교인 한국디지털미디어고등학교에 진학하여 훌륭한 친구들과 선후배를 만날 수 있었습니다. 학교 시스템을 전산화한 인트라넷 ‘디미고인’과 바다 산호 생태계 조성 로봇 모니터링 플랫폼 ‘위버’를 개발했습니다.<br /><br />
    
    2019년부터 2023년 여름까지 설리번 프로젝트와 함께했습니다. 훌륭한 친구 3명과 코딩 교육 커리큘럼을 구상하고 경기도 안양에서 예쁜 아이들에게 만들고 싶은 것을 만드는 경험을 선물했습니다. 이후 운영진으로서, 설리번 프로젝트를 거쳐간 사람들이 ”스스로 문제를 정의하고 문제를 해결하기 위해 주도적으로 학습하며 타인과 협업할 수 있는 문화를 어떻게 해야 만들어갈 수 있을지“ 사유하고 실천하는 힘을 기를 수 있도록 노력했습니다.<br /><br />
    
    저는 여행과 바다를 사랑하고, 스쿠버 다이빙을 즐깁니다. 한국, 일본, 태국뿐만 아니라 유럽의 여러 지역을 다녀왔지만 앞으로도 더 많은 나라를 여행하고 탐험하며 세계 각지의 문화와 자연을 경험하고 싶습니다.
  `,
};
